app/controllers/sessions_controller.rb

  def create
    #raise request.env["omniauth.auth"].to_yaml
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid']).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "email", "name", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '625027245' LIMIT 1